# Вы пользуетесь общественным транспортом? 
# Вероятно, вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером, 
# где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
# Вам требуется написать программу, которая проверяет счастливость билета.

# *Пример:*

# 385916 -> yes
# 123456 -> no

N = input('Введите номер Вашего билета:  ')

if (int (N[0]) + int (N[1]) + int (N[2]) == int (N[3]) + int (N[4]) + int (N[5])):
    print ('Ваш билет счастоивый')
else:
    print("Ваш билет не счастливый")
    